<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of zoom.us.</string>
	<key>Identifier</key>
	<string>com.github.imfromthebay.download.zoom.us</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>zoom.us</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/PkgInfoReader</string>
			<key>Arguments</key>
			<dict>
			        <key>source_pkg</key>
			        <string>%pathname%/zoom.us*.pkg</string>
			</dict>
	        </dict>
	        <dict>
		        <key>Comment</key>
		        <string>Rename PKG</string>
		        <key>Arguments</key>
		        <dict>
			        <key>source_pkg</key>
			        <string>%pathname%/zoom.us*.pkg<</string>
			        <key>pkg_path</key>
			        <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
	                </dict>
		                <key>Processor</key>
            	                <string>PkgCopier</string>
                </dict>
	</array>
</dict>
</plist>
