<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Extract the flat package from the OpenVPN Connect dmg.</string>
    <key>Identifier</key>
    <string>com.github.gregreznik.autopkg.pkg.OpenVPNConnect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenVPNConnect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.OpenVPN Connect Client 3</string>
    <key>Process</key>
    <array>
        <dict>
	    <key>Comment</key>
	    <string>Copy the pkg out of the DMG</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/OpenVPN_Connect*.pkg</string>
		<key>pkg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>
