<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the OpenVPN Connect Client 3 for Mac and extracts the PKG</string>
	<key>Identifier</key>
	<string>com.github.gregreznik.download.OpenVPN Connect Client 3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenVPNConnect</string>
		<key>VERSION</key>
		<string>n/a</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://openvpn.net/vpn-server-resources/connecting-to-access-server-with-macos</string>
				<key>re_pattern</key>
				<string>(/downloads/openvpn-connect-v3-.*.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://openvpn.net%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
	        <key>Arguments</key>
	        <dict>
	            <key>input_path</key>
	            <string>%pathname%/OpenVPN_Connect*.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: OPENVPN TECHNOLOGIES, INC. (ACV7L3WCD8)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
	        </dict>
	        <key>Processor</key>
	        <string>CodeSignatureVerifier</string>
	    </dict>
	    <dict>
		    <key>Comment</key>
		    <string>Copy the pkg out of the DMG</string>
		    <key>Arguments</key>
		    <dict>
			       <key>source_pkg</key>
			       <string>%pathname%/OpenVPN_Connect*.pkg</string>
			       <key>pkg_path</key>
			       <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-latest.pkg</string>
	     </dict>
		    <key>Processor</key>
            	    <string>PkgCopier</string>
        </dict>
	<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/PkgInfoReader</string>
			<key>Arguments</key>
			<dict>
			<key>source_pkg</key>
			<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-latest.pkg</string>
			</dict>
	</dict>
        <dict>
		    <key>Comment</key>
		    <string>Rename PKG</string>
		    <key>Arguments</key>
		    <dict>
			       <key>source_pkg</key>
			       <string>%pathname%/downloads/%NAME%.pkg</string>
			       <key>pkg_path</key>
			       <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
	     </dict>
		    <key>Processor</key>
            	    <string>PkgCopier</string>
        </dict>
	</array>
</dict>
</plist>
