<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Intel Power Gadget and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.imfromthebay.pkg.IntelPowerGadget</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Intel Power Gadget</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.imfromthebay.download.IntelPowerGadget</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/PkgInfoReader</string>
			<key>Arguments</key>
				<dict>
			        <key>source_pkg</key>
			        <string>%pathname%/%NAME%.pkg</string>
				</dict>
	    </dict>
	    <dict>
		    <key>Comment</key>
		    <string>Copy the pkg out of the DMG</string>
		    <key>Arguments</key>
		        <dict>
			        <key>source_pkg</key>
			        <string>%pathname%/%NAME%.pkg</string>
			        <key>pkg_path</key>
			        <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
	            </dict>
		            <key>Processor</key>
            	    <string>PkgCopier</string>
         </dict>
	</array>
</dict>
</plist>
